<?php


return [
    'exists' => 'Такой анонс уже существует',
    'object_not_found' => 'Обьект не найден',
    'not_found' => 'Анонс не найден',
    'params_required' => 'Не заданы все параметры',
    'validation' => [
        'object_type' => 'Поле "Тип обьекта" обязательно для заполнения',
        'term' => 'Поле поиска обязательно для заполнения',
        'objects' => 'Не существует такого обьекта (:objects)',
        'term_min' => 'Минимальное количество символов для поиска: 3',
        'title' => 'Поле "Заголовок" обязательно для заполнения',
        'object_id' => 'Поле "ID обьекта" обязательно для заполнения',
        'description' => 'Описание обязательно для заполнения',
        'announce_id' => 'ID анонса обязательно',
        'announce_type' => 'Тип анонса обязателен для заполнения',
        'announce_id_int' => 'Неверный формат ID анонса',
        'object_id_int' => 'Неверный формат ID обьекта'

    ]
];